import React from 'react';
import './SideBar.scss';
import { useNavigate, Link } from 'react-router-dom';
import ArrowBackIosIcon from '@mui/icons-material/ArrowBackIos';
export default function SideBar() {
    const navigate = useNavigate()
    const Close = () => {
        localStorage.setItem('admin', 'false')
        navigate('/')
        window.location.reload();
    }
    return (
        <div className="sidebar">
            <div className="sidebar-wrapper">
                <h1>Quản lý sản phẩm</h1>
                <ul>
                    <Link to='/'>
                        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 48 48" id="shopping-bag"><path d="m4.18 41.26 6.13 4c.06.04.12.06.18.08.05.02.1.05.15.07.16.05.32.09.49.09H41c.96 0 1.89-.4 2.55-1.1.66-.7 1-1.65.94-2.61l-1.87-29.88c-.05-.79-.71-1.41-1.5-1.41h-5.35c-1.81-4.67-6.34-8-11.65-8s-9.84 3.33-11.65 8H7.13c-.03 0-.06.01-.09.01-.05 0-.11.01-.16.02l-.15.03c-.05.01-.1.03-.14.05-.05.02-.1.04-.15.07-.04.02-.08.04-.12.07a1.213 1.213 0 0 0-.24.19c-.02.02-.05.04-.08.07-.01.01-.02.03-.03.04l-.09.12c-.03.04-.06.08-.08.12-.03.05-.05.11-.07.17-.01.04-.03.07-.04.11-.02.07-.03.14-.04.21 0 .03-.01.06-.02.1v.01l-2.13 28c-.04.54.22 1.07.68 1.37zM24.13 5.5c3.61 0 6.76 2.03 8.36 5H15.77c1.6-2.97 4.75-5 8.36-5zm-12.4 8c-.06.49-.1.99-.1 1.5v4c0 .83.67 1.5 1.5 1.5s1.5-.67 1.5-1.5v-4c0-.51.05-1.01.13-1.5H33.5c.08.49.13.99.13 1.5v4c0 .83.67 1.5 1.5 1.5s1.5-.67 1.5-1.5v-4c0-.51-.04-1.01-.1-1.5h3.19l1.78 28.47c.01.19-.08.31-.13.37-.06.06-.18.16-.37.16H12.45l-3.63-29h2.91zM7.49 27l1.75 13.97-2.68-1.75L7.49 27z"></path></svg>
                        <h2>Tổng quan</h2>
                    </Link>
                    <Link to="/admin/user">
                        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" id="person"><g data-name="Layer 2"><path d="M12 11a4 4 0 1 0-4-4 4 4 0 0 0 4 4zm6 10a1 1 0 0 0 1-1 7 7 0 0 0-14 0 1 1 0 0 0 1 1z" data-name="person"></path></g></svg>
                        <h2>Quản lý tài khoản</h2> </Link>
                    <Link to='/admin/order'>
                        <svg xmlns="http://www.w3.org/2000/svg" width="80" height="80" viewBox="0 0 80 80" id="order-list"><path fill="#3F4662" d="M58.177 80H8.346A7.155 7.155 0 0 1 .99 73.083V6.916A7.155 7.155 0 0 1 8.346 0h49.831a7.155 7.155 0 0 1 7.358 6.916V18.15a1.991 1.991 0 0 1-3.982 0V6.916A3.176 3.176 0 0 0 58.177 4H8.346a3.174 3.174 0 0 0-3.374 2.916v66.167A3.174 3.174 0 0 0 8.346 76h49.831a2 2 0 1 1 0 4zM37.6 44.149h-7.965a2 2 0 1 1 0-4H37.6a2 2 0 1 1 0 4zm-17.92 0h-7.964a2 2 0 1 1 0-4h7.964a2 2 0 1 1-.004 4h.004zm17.92 8h-7.965a2 2 0 1 1 0-4H37.6a2 2 0 1 1 0 4zm-17.92 0h-7.964a2 2 0 1 1 0-4h7.964a2 2 0 0 1-.004 4h.004zm17.92 8h-7.965a2 2 0 1 1 0-4H37.6a2 2 0 1 1 0 4zm-17.92 0h-7.964a2 2 0 1 1 0-4h7.964a2 2 0 0 1-.004 4h.004zm35.363-40h-7.488a2 2 0 1 1 0-4h7.488a2 2 0 0 1-.004 4h.004zm-17.443 0h-7.965a2 2 0 1 1 0-4H37.6a2 2 0 1 1 0 4zm-17.92 0h-7.964a2 2 0 1 1 0-4h7.964a2 2 0 0 1-.004 4h.004zm17.92 8h-7.965a2 2 0 1 1 0-4H37.6a2 2 0 1 1 0 4zm-17.92 0h-7.964a2 2 0 1 1 0-4h7.964a2 2 0 0 1-.004 4h.004zm17.92 8h-7.965a2 2 0 1 1 0-4H37.6a2 2 0 1 1 0 4zm-17.92 0h-7.964a2 2 0 1 1 0-4h7.964a2 2 0 0 1-.004 4h.004zm57.142 37.478c-.1 0-.352-.019-.449-.033-11.029-1.627-21.81-4.838-22.588-23.772h-8.443a2 2 0 0 1-1.567-3.234l14.958-19.151a1.988 1.988 0 0 1 3.135 0l14.956 19.151a2 2 0 0 1-1.567 3.234h-8.518c-.407 10.127 3.465 14.041 11.431 18.213a2.966 2.966 0 0 1-1.352 5.592h.004zM49.435 45.822h6.3a1.994 1.994 0 0 1 1.991 1.991c.061 14.4 5.633 18.774 13.6 20.765-6.156-4.357-9.345-10.038-8.439-20.922a1.992 1.992 0 0 1 1.983-1.834h6.3L60.3 31.912l-10.865 13.91z"></path></svg>
                        <h2> Đơn đặt hàng</h2>
                    </Link>
                    <Link to='/admin/warehouse'>
                        <svg
                            xmlns="http://www.w3.org/2000/svg"
                            viewBox="0 0 48 48"
                            id="warehouse">
                            <g data-name="Layer 11">
                                <path d="M43,15.87a.48.48,0,0,0,0-.2,1.3,1.3,0,0,0-.08-.17l-.11-.16a.93.93,0,0,0-.15-.13.7.7,0,0,0-.1-.08l-18-10a1,1,0,0,0-1,0l-18,10a.7.7,0,0,0-.1.08.93.93,0,0,0-.15.13l-.11.16a1.3,1.3,0,0,0-.08.17.48.48,0,0,0,0,.2A.61.61,0,0,0,5,16v6a1,1,0,0,0,1,1H8V42c-.07,1.64,3.13.81,4,1H36c.84-.19,4.1.64,4-1V23h2a1,1,0,0,0,1-1V16A.61.61,0,0,0,43,15.87ZM24,29a1,1,0,0,0,1-1V27h2v6H21V27h2v1A1,1,0,0,0,24,29Zm-4,8a1,1,0,0,0,1-1V35h2v6H17V35h2v1A1,1,0,0,0,20,37Zm5,4V35h2v1a1,1,0,0,0,2,0V35h2v6Zm8,0V34a1,1,0,0,0-1-1H29V26a1,1,0,0,0-1-1H20a1,1,0,0,0-1,1v7H16a1,1,0,0,0-1,1v7H13V23H35V41Zm5,0H37V22a1,1,0,0,0-1-1H12a1,1,0,0,0-1,1V41H10V18.6l14-7.47L38,18.6Zm2-20V18a.5.5,0,0,0,0-.13.78.78,0,0,0,0-.21.7.7,0,0,0-.09-.17l-.1-.15a.91.91,0,0,0-.16-.13.87.87,0,0,0-.11-.09l-15-8a1,1,0,0,0-.94,0l-15,8-.11.08a2,2,0,0,0-.16.14l-.1.15a.7.7,0,0,0-.09.17.78.78,0,0,0,0,.21A.5.5,0,0,0,8,18v3H7V16.59L24,7.14l17,9.45V21Z"></path>
                                <path d="M28,17H20a1,1,0,0,0,0,2h8a1,1,0,0,0,0-2Z"></path>
                            </g>
                        </svg>
                        <h2 >Quản lý kho</h2>
                    </Link>
                    <Link to='/admin/contact'>
                        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 144 144" id="contact"><path fill="#528AC8" d="M124.36 129.055h-94V74.441c-1-1.31-3.5-3.598-4.215-3.741-1.072-.214-1.785 1.838-1.785 3.741v53.944c0 1.509.698 3.016 2.053 3.485 1.71 1.493 4.234 2.609 5.921 2.609l90.504-.02c1.903 0 3.435-1.245 4.785-2.604l.757.696" opacity=".3"></path><path fill="none" stroke="#3D6CB4" strokeLinecap="round" strokeLinejoin="round" strokeMiterlimit="10" d="M26.045 70.16a7.988 7.988 0 0 0-2.251 5.556v50.749c0 4.408 3.607 8.015 8.015 8.015h90.442c4.408 0 8.015-3.607 8.015-8.015v-50.75a7.986 7.986 0 0 0-2.251-5.555M91.621 100.892l36.367-30.753M26.069 70.136l36.272 30.674M32.608 63.599l-6.539 6.537M99.073 41.227 77.03 19.186 54.965 41.247M127.988 70.139l-6.495-6.495M77.028 88.9l-51.207 42.878M77.028 88.9l50.96 42.944"></path><path fill="none" stroke="#3D6CB4" strokeLinecap="round" strokeLinejoin="round" strokeMiterlimit="10" d="m121.453 75.666.115-34.439h-88.96v34.439"></path><g transform="rotate(-6.76 59.482 66.906)"><circle cx="59.468" cy="66.892" r="4.479" fill="#528AC8" opacity=".3"></circle><circle cx="59.468" cy="66.892" r="4.479" fill="none" stroke="#3D6CB4" strokeLinecap="round" strokeLinejoin="round" strokeMiterlimit="10"></circle></g><g transform="rotate(-6.76 77.857 66.906)"><circle cx="77.838" cy="66.892" r="4.479" fill="#528AC8" opacity=".3"></circle><circle cx="77.838" cy="66.892" r="4.479" fill="none" stroke="#3D6CB4" strokeLinecap="round" strokeLinejoin="round" strokeMiterlimit="10"></circle></g><g transform="rotate(-6.76 96.231 66.906)"><circle cx="96.209" cy="66.892" r="4.479" fill="#528AC8" opacity=".3"></circle><circle cx="96.209" cy="66.892" r="4.479" fill="none" stroke="#3D6CB4" strokeLinecap="round" strokeLinejoin="round" strokeMiterlimit="10"></circle></g><path fill="none" stroke="#3D6CB4" strokeLinecap="round" strokeLinejoin="round" strokeMiterlimit="10" d="M115.727 11.498v11.845M121.649 17.421h-11.844M8.967 47.564v11.844M3.045 53.486h11.844M136.994 51.95v7.091M140.539 55.496h-7.091"></path></svg>
                        <h2> Liên hệ</h2>
                    </Link>

                    <div className="close" onClick={Close}> <ArrowBackIosIcon />
                        <p>Trở về mua sắm</p>
                    </div>
                </ul>
            </div>
        </div>
    );
}
